# Exercise 1 -  Sakila Star Schema & ETL  

All the database tables in this demo are based on public database samples and transformations
- `Sakila` is a sample database created by `MySql` [Link](https://video.udacity-data.com/topher/2021/August/61120e06_pagila-3nf/pagila-3nf.png)
- The postgresql version of it is called `Pagila` [Link](https://github.com/devrimgunduz/pagila)
- The facts and dimension tables design is based on O'Reilly's public dimensional modelling tutorial schema [Link](https://video.udacity-data.com/topher/2021/August/61120d38_pagila-star/pagila-star.png)

# STEP0: Using ipython-sql

- Load ipython-sql: `%load_ext sql`

- To execute SQL queries you write one of the following atop of your cell: 
    - `%sql`
        - For a one-liner SQL query
        - You can access a python var using `$`    
    - `%%sql`
        - For a multi-line SQL query
        - You can **NOT** access a python var using `$`


- Running a connection string like:
`postgresql://postgres:postgres@db:5432/pagila` connects to the database

# STEP1 : Connect to the local database where Pagila is loaded

##  1.1 Create the pagila db and fill it with data
- Adding `"!"` at the beginning of a jupyter cell runs a command in a shell, i.e. we are not running python code but we are running the `createdb` and `psql` postgresql commmand-line utilities

In [1]:
# %pip install psycopg2-binary
# %pip install snowflake-connector-python
# %pip install mysql-connector-python

In [2]:
import psycopg2

In [3]:
# !PGPASSWORD=natbernard createdb -h 127.0.0.1 -U postgres pagila
# !PGPASSWORD=natbernard psql -q -h 127.0.0.1 -U postgres -d pagila -f pagila-schema.sql
# !PGPASSWORD=natbernard psql -q -h 127.0.0.1 -U postgres -d pagila -f pagila-data.sql

## 1.2 Connect to the newly created db

In [4]:
%load_ext sql

In [5]:
DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'postgres'
DB_PASSWORD = 'natbernard'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)

postgresql://postgres:natbernard@127.0.0.1:5432/pagila

In [6]:
%sql $conn_string

'Connected: postgres@pagila'

# STEP2 : Explore the  3NF Schema

<img src="./pagila-3nf.png" width="50%"/>

## 2.1 How much? What data sizes are we looking at?

In [10]:
nStores = %sql select count(*) from store;
nFilms = %sql select count(*) from film;
nCustomers = %sql select count(*) from customer;
nRentals = %sql select count(*) from rental;
nPayment = %sql select count(*) from payment;
nStaff = %sql select count(*) from staff;
nCity = %sql select count(*) from city;
nCountry = %sql select count(*) from country;

print("nFilms\t\t=", nFilms[0][0])
print("nCustomers\t=", nCustomers[0][0])
print("nRentals\t=", nRentals[0][0])
print("nPayment\t=", nPayment[0][0])
print("nStaff\t\t=", nStaff[0][0])
print("nStores\t\t=", nStores[0][0])
print("nCities\t\t=", nCity[0][0])
print("nCountry\t=", nCountry[0][0])

 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.
nFilms		= 1000
nCustomers	= 599
nRentals	= 16044
nPayment	= 16049
nStaff		= 2
nStores		= 2
nCities		= 600
nCountry	= 109

## 2.2 When? What time period are we talking about?

In [11]:
%%sql 
select min(payment_date) as start, max(payment_date) as end from payment;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.

[(datetime.datetime(2017, 1, 24, 21, 21, 56, 996577, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), datetime.datetime(2017, 5, 14, 13, 44, 29, 996577, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))))]

## 2.3 Where? Where do events in this database occur?
TODO: Write a query that displays the number of addresses by district in the address table. Limit the table to the top 10 districts. Your results should match the table below.

In [18]:
%%sql
select district, count(city_id) as n
from address
group by district
order by n desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('Buenos Aires', 10),
 ('Shandong', 9),
 ('California', 9),
 ('West Bengali', 9),
 ('Uttar Pradesh', 8),
 ('So Paulo', 8),
 ('England', 7),
 ('Maharashtra', 7),
 ('Southern Tagalog', 6),
 ('Gois', 5)]

<div class="p-Widget jp-RenderedHTMLCommon jp-RenderedHTML jp-OutputArea-output jp-OutputArea-executeResult" data-mime-type="text/html"><table>
    <tbody><tr>
        <th>district</th>
        <th>n</th>
    </tr>
    <tr>
        <td>Buenos Aires</td>
        <td>10</td>
    </tr>
    <tr>
        <td>California</td>
        <td>9</td>
    </tr>
    <tr>
        <td>Shandong</td>
        <td>9</td>
    </tr>
    <tr>
        <td>West Bengali</td>
        <td>9</td>
    </tr>
    <tr>
        <td>So Paulo</td>
        <td>8</td>
    </tr>
    <tr>
        <td>Uttar Pradesh</td>
        <td>8</td>
    </tr>
    <tr>
        <td>Maharashtra</td>
        <td>7</td>
    </tr>
    <tr>
        <td>England</td>
        <td>7</td>
    </tr>
    <tr>
        <td>Southern Tagalog</td>
        <td>6</td>
    </tr>
    <tr>
        <td>Punjab</td>
        <td>5</td>
    </tr>
</tbody></table></div>

# STEP3: Perform some simple data analysis

## 3.1 Insight 1:   Top Grossing Movies 
- Payments amounts are in table `payment`
- Movies are in table `film`
- They are not directly linked, `payment` refers to a `rental`, `rental` refers to an `inventory` item and `inventory` item refers to a `film`
- `payment` &rarr; `rental` &rarr; `inventory` &rarr; `film`

### 3.1.1 Films

In [20]:
%%sql
SELECT film_id, title, release_year, rental_rate, rating
FROM film
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 'ACADEMY DINOSAUR', 2006, Decimal('0.99'), 'PG'),
 (2, 'ACE GOLDFINGER', 2006, Decimal('4.99'), 'G'),
 (3, 'ADAPTATION HOLES', 2006, Decimal('2.99'), 'NC-17'),
 (4, 'AFFAIR PREJUDICE', 2006, Decimal('2.99'), 'G'),
 (5, 'AFRICAN EGG', 2006, Decimal('2.99'), 'G')]

### 3.1.2 Payments

In [21]:
%%sql
SELECT *
FROM payment
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(16050, 269, 2, 7, Decimal('1.99'), datetime.datetime(2017, 1, 24, 21, 40, 19, 996577, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (16051, 269, 1, 98, Decimal('0.99'), datetime.datetime(2017, 1, 25, 15, 16, 50, 996577, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (16052, 269, 2, 678, Decimal('6.99'), datetime.datetime(2017, 1, 28, 21, 44, 14, 996577, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (16053, 269, 2, 703, Decimal('0.99'), datetime.datetime(2017, 1, 29, 0, 58, 2, 996577, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (16054, 269, 1, 750, Decimal('4.99'), datetime.datetime(2017, 1, 29, 8, 10, 6, 996577, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))))]

### 3.1.3 Inventory

In [23]:
%%sql 
SELECT * 
FROM inventory
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 1, 1, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (2, 1, 1, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (3, 1, 1, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (4, 1, 1, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (5, 1, 2, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))))]

### 3.1.4 Rental

In [25]:
%%sql
SELECT *
FROM rental
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(2, datetime.datetime(2005, 5, 24, 22, 54, 33, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 1525, 459, datetime.datetime(2005, 5, 28, 19, 40, 33, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 1, datetime.datetime(2017, 2, 16, 2, 30, 53, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (3, datetime.datetime(2005, 5, 24, 23, 3, 39, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 1711, 408, datetime.datetime(2005, 6, 1, 22, 12, 39, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 1, datetime.datetime(2017, 2, 16, 2, 30, 53, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (4, datetime.datetime(2005, 5, 24, 23, 4, 41, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 2452, 333, datetime.datetime(2005, 6, 3, 1, 43, 41, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 2, datetime.datetime(2017, 2, 16, 2, 30, 53, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (5, datetime.datetime(2005, 5, 24, 23, 5, 21, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 2079, 222, datetime.datetime(2005, 6, 2, 4, 33, 21, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 1, datetime.datetime(2017, 2, 16, 2, 30, 53, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (6, datetime.datetime(2005, 5, 24, 23, 8, 7, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 2792, 549, datetime.datetime(2005, 5, 27, 1, 32, 7, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 1, datetime.datetime(2017, 2, 16, 2, 30, 53, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))))]

### 3.1.5 Get the payment of every movie

In [28]:
%%sql
SELECT f.film_id, f.title, p.amount
FROM film AS f 
JOIN inventory AS i ON (f.film_id = i.film_id)
JOIN rental AS r ON (i.inventory_id = r.inventory_id)
JOIN payment AS p ON (r.rental_id = p.rental_id)
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(870, 'SWARM GOLD', Decimal('1.99')),
 (651, 'PACKER MADIGAN', Decimal('0.99')),
 (818, 'SOMETHING DUCK', Decimal('6.99')),
 (249, 'DRACULA CRYSTAL', Decimal('0.99')),
 (159, 'CLOSER BANG', Decimal('4.99'))]

### 3.1.6 Sum movie rental revenue

In [29]:
%%sql 
SELECT f.title, sum(p.amount) AS revenue
FROM film AS f 
JOIN inventory AS i ON (f.film_id = i.film_id)
JOIN rental AS r ON (i.inventory_id = r.inventory_id)
JOIN payment AS p ON (r.rental_id = p.rental_id) 
GROUP BY title 
ORDER BY revenue desc
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[('TELEGRAPH VOYAGE', Decimal('231.73')),
 ('WIFE TURN', Decimal('223.69')),
 ('ZORRO ARK', Decimal('214.69')),
 ('GOODFELLAS SALUTE', Decimal('209.69')),
 ('SATURDAY LAMBS', Decimal('204.72'))]

## 3.2 Insight 2:   Top grossing cities 
- Payments amounts are in table `payment`
- Cities are in table `cities`
- `payment` &rarr; `customer` &rarr; `address` &rarr; `city`

### 3.2.1 Payment

In [30]:
%%sql
SELECT * 
FROM payment
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(16050, 269, 2, 7, Decimal('1.99'), datetime.datetime(2017, 1, 24, 21, 40, 19, 996577, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (16051, 269, 1, 98, Decimal('0.99'), datetime.datetime(2017, 1, 25, 15, 16, 50, 996577, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (16052, 269, 2, 678, Decimal('6.99'), datetime.datetime(2017, 1, 28, 21, 44, 14, 996577, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (16053, 269, 2, 703, Decimal('0.99'), datetime.datetime(2017, 1, 29, 0, 58, 2, 996577, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (16054, 269, 1, 750, Decimal('4.99'), datetime.datetime(2017, 1, 29, 8, 10, 6, 996577, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))))]

### 3.2.2 Customer

In [31]:
%%sql
SELECT * 
FROM customer
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', 5, True, datetime.date(2017, 2, 14), datetime.datetime(2017, 2, 15, 9, 57, 20, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 1),
 (2, 1, 'PATRICIA', 'JOHNSON', 'PATRICIA.JOHNSON@sakilacustomer.org', 6, True, datetime.date(2017, 2, 14), datetime.datetime(2017, 2, 15, 9, 57, 20, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 1),
 (3, 1, 'LINDA', 'WILLIAMS', 'LINDA.WILLIAMS@sakilacustomer.org', 7, True, datetime.date(2017, 2, 14), datetime.datetime(2017, 2, 15, 9, 57, 20, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 1),
 (4, 2, 'BARBARA', 'JONES', 'BARBARA.JONES@sakilacustomer.org', 8, True, datetime.date(2017, 2, 14), datetime.datetime(2017, 2, 15, 9, 57, 20, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 1),
 (5, 1, 'ELIZABETH', 'BROWN', 'ELIZABETH.BROWN@sakilacustomer.org', 9, True, datetime.date(2017, 2, 14), datetime.datetime(2017, 2, 15, 9, 57, 20, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 1)]

### 3.2.3 Address

In [32]:
%%sql
SELECT * 
FROM address
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, '47 MySakila Drive', None, 'Alberta', 300, '', '', datetime.datetime(2017, 2, 15, 9, 45, 30, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (2, '28 MySQL Boulevard', None, 'QLD', 576, '', '', datetime.datetime(2017, 2, 15, 9, 45, 30, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (3, '23 Workhaven Lane', None, 'Alberta', 300, '', '14033335568', datetime.datetime(2017, 2, 15, 9, 45, 30, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (4, '1411 Lillydale Drive', None, 'QLD', 576, '', '6172235589', datetime.datetime(2017, 2, 15, 9, 45, 30, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (5, '1913 Hanoi Way', '', 'Nagasaki', 463, '35200', '28303384290', datetime.datetime(2017, 2, 15, 9, 45, 30, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))))]

### 3.3.4 City

In [33]:
%%sql
SELECT * 
FROM city
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 'A Corua (La Corua)', 87, datetime.datetime(2017, 2, 15, 9, 45, 25, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (2, 'Abha', 82, datetime.datetime(2017, 2, 15, 9, 45, 25, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (3, 'Abu Dhabi', 101, datetime.datetime(2017, 2, 15, 9, 45, 25, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (4, 'Acua', 60, datetime.datetime(2017, 2, 15, 9, 45, 25, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (5, 'Adana', 97, datetime.datetime(2017, 2, 15, 9, 45, 25, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))))]

### 3.3.5 Getting the payment of customers

In [36]:
%%sql
SELECT cu.customer_id, p.amount, c.city
FROM payment AS p 
JOIN customer AS cu ON (p.customer_id = cu.customer_id)
JOIN address AS a ON (cu.address_id = a.address_id)
JOIN city AS c ON (a.city_id = c.city_id)
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, Decimal('2.99'), 'Sasebo'),
 (1, Decimal('0.99'), 'Sasebo'),
 (1, Decimal('5.99'), 'Sasebo'),
 (1, Decimal('0.99'), 'Sasebo'),
 (1, Decimal('9.99'), 'Sasebo')]

### 3.3.6 Getting the sum city revenue

In [37]:
%%sql
SELECT c.city, sum(p.amount) AS revenue
FROM payment AS p
JOIN customer AS cu ON (p.customer_id = cu.customer_id)
JOIN address AS a ON (cu.address_id = a.address_id)
JOIN city AS c ON (a.city_id = c.city_id)
GROUP BY city
ORDER BY revenue desc
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[('Cape Coral', Decimal('221.55')),
 ('Saint-Denis', Decimal('216.54')),
 ('Aurora', Decimal('198.50')),
 ('Molodetno', Decimal('195.58')),
 ('Apeldoorn', Decimal('194.61'))]

## 3.3 Insight 3 : Revenue of a movie by customer city and by month

In [38]:
%%sql
SELECT * 
FROM payment
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(16050, 269, 2, 7, Decimal('1.99'), datetime.datetime(2017, 1, 24, 21, 40, 19, 996577, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (16051, 269, 1, 98, Decimal('0.99'), datetime.datetime(2017, 1, 25, 15, 16, 50, 996577, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (16052, 269, 2, 678, Decimal('6.99'), datetime.datetime(2017, 1, 28, 21, 44, 14, 996577, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (16053, 269, 2, 703, Decimal('0.99'), datetime.datetime(2017, 1, 29, 0, 58, 2, 996577, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (16054, 269, 1, 750, Decimal('4.99'), datetime.datetime(2017, 1, 29, 8, 10, 6, 996577, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))))]

In [39]:
%%sql
SELECT * 
FROM city
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 'A Corua (La Corua)', 87, datetime.datetime(2017, 2, 15, 9, 45, 25, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (2, 'Abha', 82, datetime.datetime(2017, 2, 15, 9, 45, 25, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (3, 'Abu Dhabi', 101, datetime.datetime(2017, 2, 15, 9, 45, 25, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (4, 'Acua', 60, datetime.datetime(2017, 2, 15, 9, 45, 25, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (5, 'Adana', 97, datetime.datetime(2017, 2, 15, 9, 45, 25, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))))]

In [41]:
%%sql
SELECT film_id, title, release_year, rental_rate, rating
FROM film
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 'ACADEMY DINOSAUR', 2006, Decimal('0.99'), 'PG'),
 (2, 'ACE GOLDFINGER', 2006, Decimal('4.99'), 'G'),
 (3, 'ADAPTATION HOLES', 2006, Decimal('2.99'), 'NC-17'),
 (4, 'AFFAIR PREJUDICE', 2006, Decimal('2.99'), 'G'),
 (5, 'AFRICAN EGG', 2006, Decimal('2.99'), 'G')]

In [61]:
%%sql
SELECT *
FROM language
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 'English             ', datetime.datetime(2017, 2, 15, 10, 2, 19, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (2, 'Italian             ', datetime.datetime(2017, 2, 15, 10, 2, 19, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (3, 'Japanese            ', datetime.datetime(2017, 2, 15, 10, 2, 19, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (4, 'Mandarin            ', datetime.datetime(2017, 2, 15, 10, 2, 19, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (5, 'French              ', datetime.datetime(2017, 2, 15, 10, 2, 19, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))))]

In [48]:
%%sql
SELECT f.title, sum(p.amount) as revenue, ci.city, EXTRACT(month FROM p.payment_date) AS month
FROM payment AS p
JOIN rental AS r ON ( p.rental_id = r.rental_id )
JOIN inventory AS i ON ( r.inventory_id = i.inventory_id )
JOIN film AS f ON ( i.film_id = f.film_id)
JOIN customer AS c  ON ( p.customer_id = c.customer_id )
JOIN address AS a ON ( c.address_id = a.address_id )
JOIN city AS ci ON ( a.city_id = ci.city_id ) 
GROUP BY (f.title, ci.city, month)
ORDER BY month, revenue desc
LIMIT 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('SHOW LORD', Decimal('11.99'), 'Mannheim', 1.0),
 ('CASUALTIES ENCINO', Decimal('10.99'), 'Warren', 1.0),
 ('KISSING DOLLS', Decimal('10.99'), 'Toulon', 1.0),
 ('AMERICAN CIRCUS', Decimal('10.99'), 'Callao', 1.0),
 ('TELEGRAPH VOYAGE', Decimal('10.99'), 'Naala-Porto', 1.0),
 ('STRANGER STRANGERS', Decimal('9.99'), 'Ipoh', 1.0),
 ('HEAD STRANGER', Decimal('9.99'), 'Xiangtan', 1.0),
 ('MISSION ZOOLANDER', Decimal('9.99'), 'Abha', 1.0),
 ('MILLION ACE', Decimal('9.99'), 'Gaziantep', 1.0),
 ('DARKO DORADO', Decimal('9.99'), 'Bhilwara', 1.0)]

# STEP 4 : Creating Facts & Dimensions

In [53]:
%%sql
CREATE TABLE dimDate(
    date_key    integer  NOT NULL PRIMARY KEY,
    date        date     NOT NULL,
    year        smallint NOT NULL,
    quarter     smallint NOT NULL,
    month       smallint NOT NULL,
    day         smallint NOT NULL,
    week        smallint NOT NULL,
    is_weekend  boolean
);

CREATE TABLE dimCustomer(
    customer_key SERIAL PRIMARY KEY,
    customer_id  smallint    NOT NULL,
    first_name   varchar(45) NOT NULL,
    last_name    varchar(45) NOT NULL,
    email        varchar(50),
    address      varchar(50) NOT NULL,
    address2     varchar(50),
    district     varchar(20) NOT NULL,
    city         varchar(50) NOT NULL,
    country      varchar(50) NOT NULL,
    postal_code  varchar(10),
    phone        varchar(20) NOT NULL,
    active       smallint    NOT NULL,
    create_date  timestamp   NOT NULL,
    start_date   date        NOT NULL,
    end_date     date        NOT NULL
);

CREATE TABLE dimMovie(
    movie_key SERIAL PRIMARY KEY,
    film_id             smallint     NOT NULL,
    title               varchar(255) NOT NULL,
    description         text,
    release_year        year,
    language            varchar(20)  NOT NULL,
    original_language   varchar(20),
    rental_duration     smallint     NOT NULL,
    length              smallint     NOT NULL,
    rating              varchar(5)   NOT NULL,
    special_features    varchar(60)  NOT NULL
);

CREATE TABLE dimStore(
    store_key SERIAL PRIMARY KEY,
    store_id           smallint    NOT NULL,
    address            varchar(50) NOT NULL,
    address2           varchar(50),
    district           varchar(20) NOT NULL,
    city               varchar(50) NOT NULL,
    country            varchar(50) NOT NULL,
    postal_code        varchar(10),
    manager_first_name varchar(45) NOT NULL,
    manager_last_name  varchar(45) NOT NULL,
    start_date         date        NOT NULL,
    end_date           date        NOT NULL
);

CREATE TABLE factSales(
    sales_key SERIAL PRIMARY KEY,
    date_key INT NOT NULL REFERENCES dimDate(date_key),
    customer_key INT NOT NULL REFERENCES dimCustomer(customer_key),
    movie_key INT NOT NULL REFERENCES dimMovie(movie_key),
    store_key INT NOT NULL REFERENCES dimStore(store_key),
    sales_amount decimal(5,2) NOT NULL
);

 * postgresql://postgres:***@127.0.0.1:5432/pagila
Done.
Done.
Done.

[]

# STEP 5: ETL the data from 3NF tables to Facts & Dimension Tables

In [62]:
%%sql
INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(payment_date)                                           AS date,
       EXTRACT(year FROM payment_date)                              AS year,
       EXTRACT(quarter FROM payment_date)                           AS quarter,
       EXTRACT(month FROM payment_date)                             AS month,
       EXTRACT(day FROM payment_date)                               AS day,
       EXTRACT(week FROM payment_date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) THEN true 
       ELSE false
       END AS is_weekend
FROM payment;

INSERT INTO dimCustomer(customer_key, customer_id, first_name, last_name, email, address, address2,
    district, city, country, postal_code, phone, active, create_date,start_date, end_date)
SELECT c.customer_id AS customer_key,
       c.customer_id,
       c.first_name,
       c.last_name,
       c.email,
       a.address,
       a.address2,
       a.district,
       ci.city,
       co.country,
       a.postal_code,
       a.phone,
       c.active,
       c.create_date,
       now() AS start_date,
       now() AS end_date
FROM customer AS c
JOIN address AS a ON(c.address_id = a.address_id)
JOIN city AS ci ON(a.city_id = ci.city_id)
JOIN country AS co ON(ci.country_id = co.country_id);

INSERT INTO dimMovie (movie_key, film_id, title, description, release_year, language, original_language, 
        rental_duration, length, rating, special_features)
SELECT f.film_id      AS movie_key,
       f.film_id,
       f.title,
       f.description,
       f.release_year,
       l.name         AS language,
       orig_lang.name AS original_language,
       f.rental_duration,
       f.length,
       f.rating,
       f.special_features
FROM film f
JOIN language AS l ON(f.language_id = l.language_id)
LEFT JOIN language AS orig_lang ON(f.original_language_id = orig_lang.language_id);

INSERT INTO dimStore (store_key, store_id, address, address2, district, city, country, postal_code, manager_first_name, manager_last_name, start_date, end_date)
SELECT s.store_id    AS store_key,
       s.store_id,
       a.address,
       a.address2,
       a.district,
       c.city,
       co.country,
       a.postal_code,
       st.first_name AS manager_first_name,
       st.last_name  AS manager_last_name,
       now()         AS start_date,
       now()         AS end_date
FROM store s
JOIN staff st   ON (s.manager_staff_id = st.staff_id)
JOIN address a  ON (s.address_id = a.address_id)
JOIN city c     ON (a.city_id = c.city_id)
JOIN country co ON (c.country_id = co.country_id);

INSERT INTO factSales (date_key, customer_key, movie_key, store_key, sales_amount)
SELECT TO_CHAR(p.payment_date :: DATE, 'yyyyMMDD')::integer AS date_key ,
       p.customer_id                                        AS customer_key,
       i.film_id                                            AS movie_key,
       i.store_id                                           AS store_key,
       p.amount                                             AS sales_amount
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id );

 * postgresql://postgres:***@127.0.0.1:5432/pagila
40 rows affected.
599 rows affected.
1000 rows affected.
2 rows affected.
16049 rows affected.

[]

In [64]:
!PGPASSWORD=natbernard pg_dump -h 127.0.0.1 -U postgres pagila > pagila-star.sql